---
kind: property
id: P:Autodesk.Revit.DB.Analysis.EnergyAnalysisOpening.OriginatingElementName
source: html/33883969-7965-eecb-1c0f-6f06a8e72774.htm
---
# Autodesk.Revit.DB.Analysis.EnergyAnalysisOpening.OriginatingElementName Property

The name for the originating Revit element.

## Syntax (C#)
```csharp
public string OriginatingElementName { get; }
```

## Remarks
Opening elements get an originating element assigned according to the below described schema, based on associative room bounding element:
 (Family Name) : (Family Type) Sample:
 Basic Wall : Cast Concrete Wall 12"